In [2]:
import pandas as pd
import numpy as np

In [3]:
# Series = 1d array like object which holds data with any data type
# It acts as a column

data = [x for x in range(1,11)]
series = pd.Series(data, dtype='int8')
print(series)

0     1
1     2
2     3
3     4
4     5
5     6
6     7
7     8
8     9
9    10
dtype: int8

In [4]:
# create a series from dict elements

data = {'a':1, 'b':3, 'c':3}
series = pd.Series(data, dtype='int8')
print(series)

a    1
b    3
c    3
dtype: int8

In [5]:
data = [x for x in range(10, 110, 10)]
index = ['a', 'b', 'c', 'd', 'e', 'f', 'g', 'h', 'i', 'j']
series = pd.Series(data, dtype='int8', index=index)
print(series)

a     10
b     20
c     30
d     40
e     50
f     60
g     70
h     80
i     90
j    100
dtype: int8

In [6]:
## DataFrame - two D array, similar to a database

## create a df from dict of list

data = {
    'Name': ["Deepak", "Bhanu", "Deepika"],
    'Age': [19, 20, 3], 
    'city': ['BlR', 'BLR', 'BLR']
}

df = pd.DataFrame(data)
print(df)

print(type(df))

      Name  Age city
0   Deepak   19  BlR
1    Bhanu   20  BLR
2  Deepika    3  BLR
<class 'pandas.core.frame.DataFrame'>

In [7]:
# convert the dataframe into an array

array = np.array(df)
print(array)

[['Deepak' 19 'BlR']
 ['Bhanu' 20 'BLR']
 ['Deepika' 3 'BLR']]

In [8]:
# Create a df from a list of dicts

data = [
    {'Name': 'Deepak', 'Age' : 19, 'City': 'BLR'},
    {'Name': 'Bhanu', 'Age' : 20, 'City': 'BLR'},
    {'Name': 'Bhanu', 'Age' : 3, 'City': 'BLR'},
]

df = pd.DataFrame(data)
print(df)

     Name  Age City
0  Deepak   19  BLR
1   Bhanu   20  BLR
2   Bhanu    3  BLR

In [ ]:
sales = pd.read_csv('datasets/Details.csv')
sales.head()

,Order ID,Amount,Profit,Quantity,Category,Sub-Category,PaymentMode
0,B-25681,1096,658,7,Electronics,Electronic Games,COD
1,B-26055,5729,64,14,Furniture,Chairs,EMI
2,B-25955,2927,146,8,Furniture,Bookcases,EMI
3,B-26093,2847,712,8,Electronics,Printers,Credit Card
4,B-25602,2617,1151,4,Electronics,Phones,Credit Card

In [11]:
sales.tail()

     Order ID  Amount  Profit  Quantity     Category Sub-Category PaymentMode
1495  B-25700       7      -3         2     Clothing  Hankerchief         COD
1496  B-25757    3151     -35         7     Clothing     Trousers         EMI
1497  B-25973    4141    1698        13  Electronics     Printers         COD
1498  B-25698       7      -2         1     Clothing  Hankerchief         COD
1499  B-25993    4363     305         5    Furniture       Tables         EMI

In [13]:
## Accessing data from data frame
sales['Category']

0       Electronics
1         Furniture
2         Furniture
3       Electronics
4       Electronics
           ...
1495       Clothing
1496       Clothing
1497    Electronics
1498       Clothing
1499      Furniture
Name: Category, Length: 1500, dtype: object

In [17]:
# use loc 
sales.loc[0]
sales.iloc[0][5]

/var/folders/h6/2zxlvljx3vb0hvfr9zhz6trh0000gn/T/ipykernel_28880/3186349356.py:3: FutureWarning: Series.__getitem__ treating keys as positions is deprecated. In a future version, integer keys will always be treated as labels (consistent with DataFrame behavior). To access a value by position, use `ser.iloc[pos]`
  sales.iloc[0][5]

'Electronic Games'

In [21]:
## Accessing a specified element
sales.at[0, 'PaymentMode']

'COD'

In [22]:
## Accessing a specified element using iat
sales.iat[2,5]

'Bookcases'

In [39]:
# data manipulation

df

     Name  Age cuteness
0  Deepak   19     Most
1   Bhanu   20   Chubby
2   Bhanu    3  Extreme

In [43]:
df['cuteness'] = ['Most', 'Chubby', 'Extreme']
df['city'] = ['blr', 'blr', 'blr']
df

     Name  Age cuteness city
0  Deepak   19     Most  blr
1   Bhanu   20   Chubby  blr
2   Bhanu    3  Extreme  blr

In [ ]:
# delete a column
# df.drop('City', axis=1) #view only, does not actually delete the column in the df

# pass the parameter inplace=True
df.drop('city', axis=1, inplace=True)
df

# you can drop a row too
df.drop(0, axis=0)

     Name  Age cuteness
0  Deepak   19     Most
1   Bhanu   20   Chubby
2   Bhanu    3  Extreme

In [ ]:
# you can drop a row too
df.drop(0, axis=0) # pass inplace=True to actuall delete it from the table

    Name  Age cuteness
1  Bhanu   21   Chubby
2  Bhanu    4  Extreme

In [45]:
df['Age'] = df['Age'] + 1
df

     Name  Age cuteness
0  Deepak   20     Most
1   Bhanu   21   Chubby
2   Bhanu    4  Extreme

In [48]:
sales.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1500 entries, 0 to 1499
Data columns (total 7 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   Order ID      1500 non-null   object
 1   Amount        1500 non-null   int64
 2   Profit        1500 non-null   int64
 3   Quantity      1500 non-null   int64
 4   Category      1500 non-null   object
 5   Sub-Category  1500 non-null   object
 6   PaymentMode   1500 non-null   object
dtypes: int64(3), object(4)
memory usage: 82.2+ KB

In [55]:
sales.describe()

profits = list(sales['Profit'])
print(profits)
print(sum(profits))

[658, 64, 146, 712, 1151, 247, -275, -213, -44, -54, -190, -234, -891, -492, 1050, -3, 433, 1, 721, -1, -624, 95, 254, -33, 2, 782, 370, -266, -56, -1, 202, 113, 1303, -15, 122, -212, -1, 802, 0, -7, 564, 3, -77, 5, 980, -448, 340, 460, 0, -439, 106, -123, 239, 199, -2, 624, 206, -5, 4, 1864, 147, 2, -193, 527, 342, 7, 2, -12, 536, -38, 573, -16, -2, 65, 97, 264, -13, 73, -68, -2, -2, -916, -93, 3, 192, -72, 67, 24, 16, -274, 230, -640, 486, -18, -13, -63, -706, 170, -1, 170, -1, -36, 101, 266, -48, -14, 8, -307, 199, 119, 0, 8, -225, 198, -40, -36, -2, 0, 267, -235, -1, -48, -209, -17, 248, 166, -9, 395, 303, 1, 56, -15, -100, -12, 254, 1, 1, 1, 10, 259, -187, -309, -213, 15, -2, 167, 225, -316, 316, 208, -28, 119, 292, 51, 89, 175, 262, 84, 19, 212, -424, 8, 2, -111, 371, -73, -82, -152, 9, 371, 198, 107, 91, 3, 204, 9, 392, 116, 84, 213, 12, 11, 12, -79, 29, -11, 151, 8, 3, 0, 114, 11, -31, 0, 8, 0, 11, 3, 50, 11, 11, 11, 42, 50, 11, -459, 547, 0, 11, -41, 77, 2, -90, -35, -37, 148, 53, -45, 11, -50, -36, 161, 8, -272, 4, 357, 70, 49, 48, -77, 199, -45, 50, -25, 12, 1, -314, 2, 8, 13, 412, -23, -5, 27, -124, 1, 86, 126, 66, 2, 118, -56, 14, 111, 93, -116, 212, 3, -22, 6, -192, 151, -16, -5, 234, 68, 13, -13, 88, 144, 143, 84, -29, 107, -100, -338, -47, 199, -23, 10, 108, -103, -8, 41, 57, 71, 4, 50, 7, -15, 114, 6, 32, -6, -33, -12, 36, -312, 25, 62, 72, 5, -5, -200, 26, 0, 17, 113, 74, 7, 225, 17, 93, -39, 119, -66, 15, 61, 128, 3, -7, -87, 91, 5, 2, -26, 16, 19, -63, 97, 7, 68, 19, 13, 30, 251, 0, -43, 29, -26, -55, 23, 27, -32, 3, 76, 14, -2, -3, 119, 100, -15, 61, 25, 98, 99, -78, 30, 0, 1, -28, -122, 83, 4, 180, 14, -31, -20, -114, 8, -14, -77, 15, -10, 6, 24, -28, -30, 18, -162, 6, 20, 16, 22, 24, -10, -2, 8, -345, 0, -85, 12, 7, 20, 48, 81, -38, -143, -33, 21, 87, 27, 39, 18, 62, 2, 6, -113, 4, 21, -27, 0, -48, 102, -8, -41, 40, 74, 109, -83, -42, 20, 14, 50, -30, 8, -33, -30, 4, 21, 3, 62, 62, 24, -31, 45, 52, 2, -63, -28, 27, -21, 6, 111, 2, -12, -86, -25, 2, -206, 8, -24, 64, 276, -46, -18, 6, 9, 19, -16, 0, -7, 13, -117, -146, 87, 2, 13, -25, 47, -15, 11, -26, 8, 9, -70, 61, -25, -28, -13, -62, 37, 11, 20, 99, 8, 77, 4, -70, 69, 2, -25, 32, 10, 17, -46, -51, 30, -59, 17, 63, -24, -25, 20, 0, 35, -9, -23, -135, -21, -55, 33, 46, 11, 73, -22, 55, -23, 0, 7, 2, -229, 19, -105, 5, -22, 40, 4, -50, 39, 153, 0, 12, 0, 23, 54, 15, 51, 7, -1, 22, 23, 50, -21, 48, -87, 20, -54, -15, 32, 12, -1, 22, 12, 0, 41, 34, 17, 46, 24, -17, -40, 0, 0, 22, 16, -275, 0, -14, 59, 19, 14, 44, 68, -56, 48, 12, 8, 19, -193, 29, 19, 32, -1, 12, -58, -48, 6, 14, 14, 14, 36, 30, 21, -14, -3, 13, 12, 22, 5, -12, -34, 42, -56, -84, -21, 54, -10, -79, -65, 5, 12, -154, 29, 4, 241, 47, 48, 10, 29, 36, 0, -8, 54, 17, 11, -66, 30, -11, 59, 19, 1, 23, -11, 17, 9, -6, 54, -5, -103, 16, -4, 68, 14, -39, 7, 8, 14, -140, 12, 25, -9, 47, -111, -7, 41, 9, -8, 35, 15, 27, -6, -6, 40, 22, 50, -8, 17, 46, 20, -6, -33, 25, -7, 2, 5, -7, -6, 12, 36, -6, 33, -6, -90, 11, -8, 18, -6, 18, 5, 2, 69, 0, 16, 37, 36, -19, -54, -58, 26, 6, -23, 17, 26, 9, 29, -68, 9, -62, 35, 17, 15, 20, -5, 12, 11, 14, 0, 27, 25, 15, 23, 15, 24, 2, 9, 11, 42, 14, -10, -10, 8, 0, 29, 1, 1, 36, 54, -5, 73, 35, 56, 27, 1, -89, 66, -37, 11, 41, 20, -83, 4, 15, 10, 8, -32, -55, 22, -3, -124, 22, 9, -9, -75, -42, -81, 6, 123, 122, 61, -3, 10, 15, 0, 49, 12, 13, 56, 19, 38, -41, 57, 30, 11, -124, 41, 16, 20, 6, 36, -13, 5, 20, -42, 27, 7, -92, -50, 19, 29, -25, -63, -31, 22, 46, 7, -41, 41, 21, -7, 72, 0, -13, 25, -7, -104, -49, 15, 15, 16, 0, -14, -85, 13, 19, -3, -47, 26, 5, -86, -42, -101, 38, -5, -17, -15, -4, -43, 56, -5, 25, 22, -29, 69, -52, -59, 20, 1, 27, -113, 43, 17, 14, 0, 28, 6, -18, 18, 24, 55, -8, -8, -56, 21, 6, 1, 11, -63, -3, 28, -50, 26, 1, 38, 18, -23, 14, -49, -11, 26, 86, -3, 37, 41, 15, -14, -10, 21, -11, 0, 12, 13, 5, -10, 25, 73, 10, -21, -26, 46, 17, 13, 12, 10, 60, -52, 3, -8, 20, -166, 0, 89, 17, -28, -94, -12, -12, 17, 24, 14, 17, 22, 27, -17, 44, -65, 5, 27, 7, 21, 4, -4, 26, -119, 51, 18, 0, 16, 58, 8, 36, 4, -33, -1, 56, 73, -3, 28, -19, 29, 4, 12, 5, -60, 5, -145, 4, -19, 32, 84, 31, 35, 6, 35, 18, 102, -39, 33, 6, 6, 27, 41, -21, 33, 8, 59, 38, 105, 6, -11, -252, 33, 35, 30, 7, 32, 12, 6, -3, 5, -27, 8, -27, 36, 15, 1, 38, 215, -39, 39, 18, 37, 41, -49, -81, 37, 14, 8, -17, -31, 7, -3, 24, -41, 14, 40, -63, -41, -17, 5, 47, -30, 3, -24, -51, 71, 11, 15, -78, 42, 10, 91, 3, 33, 22, 44, 44, -26, -8, 16, -114, 28, 1, -2, -64, -3, 48, 36, 47, 0, 0, 0, 13, 13, -14, 52, 29, 13, 9, 11, 50, -51, 39, 14, 0, 6, 16, -36, 12, -6, -44, -2, 140, 138, 4, -2, 75, 28, 2, -270, -147, -64, 11, 14, 312, -280, 10, -180, -31, -10, 5, -27, 144, 2, -12, 26, -5, -39, 17, 21, 50, 42, 44, 0, -15, 160, 11, 13, 28, 7, -3, -13, 52, 58, -1, -25, 74, -154, -34, 38, 0, 74, 32, 59, 30, 12, -26, 25, 11, 13, 21, 27, 6, 10, -24, -22, 16, 17, -7, 74, -26, 18, -18, 7, -37, 14, -4, 139, 18, 9, 10, 4, -94, 15, 24, 115, 33, 62, -4, 90, 137, -17, 127, -7, -10, 73, 208, 26, 31, -56, 16, -143, 3, 59, 33, 46, -13, 63, 12, 56, 3, -67, -83, -43, 21, 146, -22, -12, 28, -27, 8, 55, 74, 13, 14, 1, 10, -23, 179, 203, -25, 183, 56, 28, 17, -8, 136, -34, 10, 9, 31, 6, -12, 3, 6, 77, 10, 68, 137, 0, -6, 63, -44, -33, 18, 0, 9, -113, -10, -3, 15, -25, 6, 0, 5, -146, -128, 81, 85, 54, 11, 0, -18, 85, -43, 131, -5, -10, -13, 194, -53, 215, 69, -19, -10, 52, -174, 26, 44, 108, 2, 3, -3, 14, 139, -24, 213, 72, 90, 92, 93, 97, 90, -10, 12, -102, 113, -69, 37, 4, -444, 6, -1, -20, 5, 4, -349, 166, -204, 9, -6, 212, 110, -25, -114, -45, 13, -27, 2, -633, 9, 93, 80, 261, 15, 7, 195, 12, -24, 7, -30, -12, -2, 169, 107, -6, 5, 240, -23, 9, 1, -3, 2, -26, 5, -15, 11, -6, 193, -103, -3, 3, -56, 169, 203, 4, 43, -447, 253, 10, -2, -8, 31, -153, 8, -5, 8, 89, -15, 594, -2, 2, 43, 52, -66, 4, 180, -353, 323, -17, -6, 187, -96, 2, 120, 154, 267, -5, -190, -1, 0, 93, 6, -5, -242, -91, 9, 385, 131, -18, -66, 97, -8, 11, 4, 1, 202, 2, 355, -129, 22, -447, 8, 207, -9, 114, -10, 95, -99, 305, 293, 0, -15, 6, 206, 82, 8, 8, -130, 6, 197, 1, -38, 2, 352, 2, 209, 2, 5, -3, -1, -8, -1, 1148, 1, 0, 546, -2, 3, 5, -13, -9, -56, -153, 7, 2, -12, -11, -244, 62, 1, -4, 318, 567, 109, 742, 111, -60, 2, -2, -443, 352, 315, 346, -420, 441, 5, 552, -6, -12, 3, 421, 568, -9, -7, 5, 7, -2, 680, -1, -2, 4, -6, 2, 309, 447, -6, 503, -4, -2, 701, 276, 322, 23, -289, 64, -175, 127, -1, 191, 665, -3, -1981, 1, 0, -3, -35, 1698, -2, 305]
36963